Revit 2026 API

# CameraInfoFarDistance Property

---

Distance from eye point to far plane of view frustum along the view direction.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double FarDistance { get; }
```
```vb
Public ReadOnly Property FarDistance As Double
	Get
```
```cpp
public:
property double FarDistance {
	double get ();
}
```
```fsharp
member FarDistance : float with get
```

#### Property Value

Double

This property together with NearDistance determines the depth restrictions of a view frustum.

#### Reference

CameraInfo Class

Autodesk.Revit.DB Namespace